In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [5]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
tasks+=1
pd.read_sql(
    '''
    SELECT
        (SELECT COUNT()
        FROM boston
        WHERE CRIM IS NULL) AS CRIM_Null,

        (SELECT COUNT()
        FROM boston
        WHERE ZN IS NULL) AS ZN_Null,

        (SELECT COUNT()
        FROM boston
        WHERE INDUS IS NULL) AS INDUS_Null,

        (SELECT COUNT()
        FROM boston
        WHERE CHAS IS NULL) AS CHAS_Null,
        
        (SELECT COUNT()
        FROM boston
        WHERE NOX IS NULL) AS NOX_Null  
    FROM boston
    LIMIT 1

    ''',
    con,
)

   CRIM_Null  ZN_Null  INDUS_Null  CHAS_Null  NOX_Null
0          0        0           0          0         0

In [8]:
# —Ç–∞–∫ –∫–∞–∫ –∑–Ω–∞—á–µ–Ω–∏–π NULL –Ω–µ—Ç, –ø–æ–∏—â–µ–º –Ω—É–ª–µ–≤—ã–µ –∑–Ω–∞—á–µ–Ω–∏—è
pd.read_sql(
    '''
    SELECT
        (SELECT COUNT()
        FROM boston
        WHERE CRIM = '0.0') AS CRIM_ZERO,

        (SELECT COUNT()
        FROM boston
        WHERE ZN = '0.0') AS ZNI_ZERO,

        (SELECT COUNT()
        FROM boston
        WHERE INDUS = '0.0') AS INDUS_ZERO,

        (SELECT COUNT()
        FROM boston
        WHERE CHAS = '0.0') AS CHAS_ZERO,
        
        (SELECT COUNT()
        FROM boston
        WHERE NOX = '0.0') AS NOX_ZERO
    FROM boston
    LIMIT 1

    ''',
    con,
)

   CRIM_ZERO  ZNI_ZERO  INDUS_ZERO  CHAS_ZERO  NOX_ZERO
0          0       372           0        471         0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [9]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
        COUNT(DISTINCT CRIM) as UniqueCRIM, 
        COUNT(DISTINCT ZN) as UniqueZN, 
        COUNT(DISTINCT INDUS) as UniqueINDUS, 
        COUNT(DISTINCT CHAS) as UniqueCHAS, 
        COUNT(DISTINCT NOX) as UniqueNOX,
        COUNT(DISTINCT LSTAT) as UniqueLSTAT
    FROM boston
    ''',
    con,
)

   UniqueCRIM  UniqueZN  UniqueINDUS  UniqueCHAS  UniqueNOX  UniqueLSTAT
0         504        26           76           2         81          455

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [10]:
tasks+=1
pd.read_sql(
    '''
    SELECT Name 
    FROM (
        SELECT
            (SELECT 'CRIM') AS Name, 
            (SELECT AVG(CRIM)
                FROM (
                        SELECT CRIM
                        FROM boston
                        ORDER BY CRIM
                        LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2    -- odd 1, even 2
                        OFFSET (SELECT (COUNT(*) - 1) / 2
                                FROM boston))) AS median, 
            (SELECT MIN(CRIM) 
            FROM boston) AS min
        FROM boston
        UNION
        SELECT
            (SELECT 'ZN') AS Name, 
            (SELECT AVG(ZN)
                FROM (
                        SELECT ZN
                        FROM boston
                        ORDER BY ZN
                        LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2    -- odd 1, even 2
                        OFFSET (SELECT (COUNT(*) - 1) / 2
                                FROM boston))) AS median, 
            (SELECT MIN(ZN) FROM boston) AS min
        FROM boston
        UNION
        SELECT
            (SELECT 'INDUS') AS Name, 
            (SELECT AVG(INDUS)
                FROM (
                        SELECT INDUS
                        FROM boston
                        ORDER BY INDUS
                        LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2    -- odd 1, even 2
                        OFFSET (SELECT (COUNT(*) - 1) / 2
                                FROM boston))) AS median, 
            (SELECT MIN(INDUS) FROM boston) AS min
        FROM boston
        UNION
        SELECT
            (SELECT 'CHAS') AS Name, 
            (SELECT AVG(CHAS)
                FROM (
                        SELECT CHAS
                        FROM boston
                        ORDER BY CHAS
                        LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2    -- odd 1, even 2
                        OFFSET (SELECT (COUNT(*) - 1) / 2
                                FROM boston))) AS median, 
            (SELECT MIN(CHAS) FROM boston) AS min
        FROM boston
        UNION
        SELECT
            (SELECT 'NOX') AS Name, 
            (SELECT AVG(NOX)
                FROM (
                        SELECT NOX
                        FROM boston
                        ORDER BY NOX
                        LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2    -- odd 1, even 2
                        OFFSET (SELECT (COUNT(*) - 1) / 2
                                FROM boston))) AS median, 
            (SELECT MIN(NOX) FROM boston) AS min
        FROM boston)
    WHERE median = min
    ''',
    con,
)

   Name
0  CHAS
1    ZN

–í—ã–≤–æ–¥: –ø–æ–ª–æ–≤–∏–Ω–∞ –∏–ª–∏ –±–æ–ª—å—à–µ –ø–æ–ª–æ–≤–∏–Ω—ã –¥–æ–º–æ–≤:
- —Ä–∞—Å–ø–æ–ª–æ–∂–µ–Ω—ã –Ω–µ —É —Ä–µ–∫–∏ (CHAS = '0.0')
- –Ω–µ –∏–º–µ—é—Ç –¥–æ–ª—é –∑–µ–º–ª–∏ –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É, –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–Ω—É—é –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤ (ZN = '0.0')

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [11]:
tasks+=1
pd.read_sql(
    '''
    WITH top_25 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV DESC
        limit 25),
        low_25 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV
        limit 25),

        top_50 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV DESC
        limit 50),
        low_50 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV
        limit 50),

        top_100 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV DESC
        limit 100),
        low_100 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV
        limit 100),

        top_200 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV DESC
        limit 200),
        low_200 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV
        limit 200),

        top_300 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV DESC
        limit 300),
        low_300 AS
        (SELECT RM
        FROM boston
        ORDER BY MEDV
        limit 300)

    SELECT
        (SELECT 25) AS Q,
        (SELECT AVG(RM) FROM top_25) AS top,
        (SELECT AVG(RM) FROM low_25) AS low,
        (SELECT AVG(RM) FROM top_25) - (SELECT AVG(RM) FROM low_25) AS dif
    FROM boston
    UNION
    SELECT
        (SELECT 50) AS Q,
        (SELECT AVG(RM) FROM top_50) AS top,
        (SELECT AVG(RM) FROM low_50) AS low,
        (SELECT AVG(RM) FROM top_50) - (SELECT AVG(RM) FROM low_50) AS dif
    FROM boston
    UNION
    SELECT
        (SELECT 100) AS Q,
        (SELECT AVG(RM) FROM top_100) AS top,
        (SELECT AVG(RM) FROM low_100) AS low,
        (SELECT AVG(RM) FROM top_100) - (SELECT AVG(RM) FROM low_100) AS dif
    FROM boston
    UNION
    SELECT
        (SELECT 200) AS Q,
        (SELECT AVG(RM) FROM top_200) AS top,
        (SELECT AVG(RM) FROM low_200) AS low,
        (SELECT AVG(RM) FROM top_200) - (SELECT AVG(RM) FROM low_200) AS dif
    FROM boston
    UNION
    SELECT
        (SELECT 300) AS Q,
        (SELECT AVG(RM) FROM top_300) AS top,
        (SELECT AVG(RM) FROM low_300) AS low,
        (SELECT AVG(RM) FROM top_300) - (SELECT AVG(RM) FROM low_300) AS dif
    FROM boston
    ''',
    con,
)

     Q       top       low       dif
0   25  7.637320  5.747840  1.889480
1   50  7.487060  5.753240  1.733820
2  100  7.198760  5.887120  1.311640
3  200  6.758680  5.911705  0.846975
4  300  6.539007  5.972227  0.566780

–í—ã–≤–æ–¥: —á–µ–º –±–æ–ª—å—à–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –¥–æ–º–µ, —Ç–µ–º –¥–æ—Ä–æ–∂–µ —Å—Ç–æ–∏—Ç –¥–æ–º. –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤–ª–∏—è–µ—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–∞ —Å–∏–ª—å–Ω–æ.

5.  –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [12]:
tasks+=1
pd.read_sql(
    '''
    WITH rank_LSTAT AS (
        SELECT LSTAT, 
        MEDV, 
        rank() OVER (PARTITION BY LSTAT ORDER BY MEDV) rankLSTAT
        FROM boston)

    SELECT LSTAT, MEDV, rankLSTAT
    FROM rank_LSTAT
    WHERE MEDV = (SELECT MAX(MEDV) FROM boston)
    ORDER BY rankLSTAT
    ''',
    con,
)

    LSTAT  MEDV  rankLSTAT
0    1.73  50.0          1
1    1.92  50.0          1
2    2.88  50.0          1
3    2.96  50.0          1
4    2.97  50.0          1
5    3.26  50.0          1
6    3.32  50.0          1
7    3.70  50.0          1
8    3.73  50.0          1
9    4.63  50.0          1
10   5.12  50.0          1
11   8.88  50.0          1
12   9.53  50.0          1
13   3.16  50.0          2
14   4.45  50.0          2
15   7.44  50.0          2

–í—ã–≤–æ–¥: –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –∑–∞–≤–∏—Å–∏–º–æ—Å—Ç—å, —á—Ç–æ —á–µ–º –Ω–∏–∂–µ –ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –Ω–∏–∑–∫–∏–º –¥–æ—Ö–æ–¥–æ–º (LSTAT), —Ç–µ–º –≤—ã—à–µ —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–∞(MEDV).

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT ROUND(AVG(MEDV), 2) AS AVG_cost, CHAS
    FROM boston
    GROUP BY CHAS
    ''',
    con,
)

   AVG_cost  CHAS
0     22.09   0.0
1     28.44   1.0

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [14]:
tasks+=1
pd.read_sql(
    '''
    SELECT a.NAME
    FROM(
        SELECT 
            (SELECT 'CRIM') AS NAME,
            (SELECT AVG(CRIM) FROM boston where CHAS = 1) - (SELECT AVG(CRIM) FROM boston where CHAS = 0) AS dif
        FROM boston
        UNION
        SELECT 
            (SELECT 'ZN') AS NAME,
            (SELECT AVG(ZN) FROM boston where CHAS = 1) - (SELECT AVG(ZN) FROM boston where CHAS = 0) AS dif
        FROM boston
        UNION
        SELECT 
            (SELECT 'INDUS') AS NAME,
            (SELECT AVG(INDUS) FROM boston where CHAS = 1) - (SELECT AVG(INDUS) FROM boston where CHAS = 0) AS dif
        FROM boston
        UNION
        SELECT 
            (SELECT 'CHAS') AS NAME,
            (SELECT AVG(CHAS) FROM boston where CHAS = 1) - (SELECT AVG(CHAS) FROM boston where CHAS = 0) AS dif
        FROM boston
        UNION
        SELECT 
            (SELECT 'NOX') AS NAME,
            (SELECT AVG(NOX) FROM boston where CHAS = 1) - (SELECT AVG(NOX) FROM boston where CHAS = 0) AS dif
        FROM boston) a
    WHERE dif > 0
    ''',
    con,
)

    NAME
0   CHAS
1  INDUS
2    NOX

–í—ã–≤–æ–¥: –µ—Å–ª–∏ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, —Ç–æ
- –≤—ã—à–µ –¥–æ–ª—è –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏ (INDUS)
- –≤—ã—à–µ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (NOX)

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [15]:
tasks+=1
pd.read_sql(
    '''
    SELECT PERCENTILE, round(AVG(INDUS), 2) AS INDUS, round(AVG(NOX), 2) AS NOX
    FROM
        (SELECT INDUS, NOX,
            (NTILE(10) OVER (ORDER BY INDUS, NOX))*10 AS 'PERCENTILE'
        FROM boston)
    GROUP BY PERCENTILE
    ''',
    con,
)

   PERCENTILE  INDUS   NOX
0          10   2.02  0.44
1          20   3.65  0.49
2          30   5.25  0.45
3          40   6.47  0.47
4          50   8.26  0.53
5          60  10.75  0.52
6          70  17.25  0.56
7          80  18.10  0.68
8          90  18.31  0.71
9         100  21.94  0.69

–í—ã–≤–æ–¥: —á–µ–º –≤—ã—à–µ –¥–æ–ª—è –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏, —Ç–µ–º –≤—ã—à–µ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [16]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ